Revit 2024 API
Document.SetUnits Method
 Sets the units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void SetUnits(
	Units units
)
Visual Basic
Public Sub SetUnits ( _
	units As Units _
)
Visual C++
public:
void SetUnits(
	Units^ units
)
Parameters
units
Type: Autodesk.Revit.DB.Units
 The units.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
Document Class
Autodesk.Revit.DB Namespace